; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	thermograph1 - mode
	image0 - mode
	thermograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star0)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(have_image Phenomenon5 image0)
	(have_image Planet6 thermograph2)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon8 image0)
	(have_image Star9 image0)
))

)

; plan
1. (turn_to satellite0 groundstation4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 5
5. (take_image satellite0 phenomenon7 instrument0 image0)
   added: (have_image phenomenon7 image0)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon5 instrument0 image0)
   added: (have_image phenomenon5 image0)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon8 instrument0 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 5
10. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   goals met: 3 of 5
11. (take_image satellite0 planet6 instrument0 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 4 of 5
12. (turn_to satellite0 star9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star9)
   goals met: 4 of 5
13. (take_image satellite0 star9 instrument0 image0)
   added: (have_image star9 image0)
   goals met: 5 of 5
